{"scoring":"Баллы за каждую подзадачу начисляются только в случае, если все тесты для этой\r\nподзадачи и всех необходимых подзадач успешно пройдены. \r\n\r\nОбозначим за $n$ длину закодированной строки, а за $L$ длину исходной строки.\r\n\r\n\\begin{center}\r\n\\renewcommand{\\arraystretch}{1.3}\r\n\\begin{tabular}{|c|c|c|c|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Информация\\\\о проверке\\\\\\vspace{2mm}}}\\\\\r\n\\hline\r\n1 & 9 & $1 \\le n \\le L \\le 10$ & & полная \\\\ \\hline\r\n2 & 17 & $1 \\le n \\le 100$, $1 \\le L \\le {10}^4$ & 1 & первая ошибка \\\\ \\hline\r\n3 & 21 & $1 \\le n \\le 1000$, $1 \\le L \\le {10}^5$ & 1, 2 & первая ошибка \\\\ \\hline\r\n4 & 11 & $1 \\le n \\le {10}^5$, $1 \\le L \\le {10}^7$ & 1--3 & первая ошибка \\\\ \\hline\r\n5 & 42 & $1 \\le n \\le {10}^5$, $1 \\le L \\le {10}^9$ & 1--4 & первая ошибка \\\\ \\hline\r\n\\end{tabular}\r\n\\end{center}\r\n","notes":"Исходная последовательность имела вид <<\\t{AAAAACAAAAACC}>>. \r\n\r\nПервая операция превращает её в последовательность <<\\t{AAAAAAAAAAACC}>>, которая кодируется как <<\\t{11A2C}>>. Эта закодированная последовательность имеет минимальную возможную для этого теста длину, равную $5$. \r\n\r\nВторая операция превращает её в последовательность <<\\t{AACAAACAAAAACC}>>, которая кодируется как <<\\t{2AC3AC5A2C}>>. Эта закодированная последовательность имеет максимальную возможную для этого теста длину, равную $10$.","legend":"Биологи обнаружили новый живой организм и решили изучить его ДНК. ДНК кодируется последовательностью символов <<\\t{A}>>, <<\\t{G}>>, <<\\t{C}>> и <<\\t{T}>>. \r\n\r\nТак как строка, кодирующая ДНК, часто очень длинная, для её хранения применяют RLE-кодирование. А именно, каждый блок, состоящий из двух или более идущих подряд одинаковых символов, заменяется на число, равное длине этого блока, после которого записывается соответствующий символ. Например, последовательность <<\\t{AAAGGTCCA}>> в закодированной форме имеет вид <<\\t{3A2GT2CA}>>.\r\n\r\nВ результате экспериментов, проводимых в лаборатории, ДНК может мутировать. Каждая мутация \"--- это либо удаление одного символа из последовательности, либо добавление одного символа, либо замена одного символа на другой.\r\n\r\nУходя вечером из лаборатории, учёный записал ДНК в закодированной форме. Когда он вернулся на работу утром, он обнаружил, что в ДНК произошла ровно одна мутация. Теперь ученых интересует, какая минимальная и максимальная длина может получиться у новой ДНК в закодированной форме.\r\n\r\nТребуется по заданной ДНК в закодированной форме определить, какая мутация может привести к тому, что у новой ДНК будет закодированная форма минимальной возможной длины, а какая \"--- к тому, что у новой ДНК будет закодированная форма максимальной возможной длины.","authorLogin":"senek_K","language":"russian","timeLimit":1000,"output":"В первой строке выведите мутацию, после которой закодированная строка имеет минимальную длину. Выведите:\r\n\\begin{itemize}[noitemsep,leftmargin=2cm]\r\n\\item \\t{1 $x$ Z},  если надо вставить символ \\t{Z} так, чтобы слева от него было ровно $x$ старых символов. Символ \\t{Z} должен быть из множества \\{\\t{A}, \\t{C}, \\t{G}, \\t{T}\\}.\r\n\\item \\t{2 $x$}, если надо удалить символ с номером $x$ из последовательности.\r\n\\item \\t{3 $x$ Z}, если надо заменить символ с номером $x$ заменить на символ \\t{Z}. Символ \\t{Z} должен быть из множества \\{\\t{A}, \\t{C}, \\t{G}, \\t{T}\\}. При этом на этом месте до мутации обязательно должен был находиться символ, не равный \\t{Z}. \r\n\\end{itemize}\r\n\r\nВ следующей строке выведите мутацию, после которой закодированная строка имеет максимальную длину, в таком же формате.\r\n\r\nЕсли подходящих ответов несколько, можно вывести любой из них.\r\n","inputFile":"stdin","outputFile":"stdout","input":"В единственной строке входа находится строка $s$, состоящая из цифр и букв \r\n<<\\t{A}>>, <<\\t{G}>>, <<\\t{C}>> и <<\\t{T}>> \"--- закодированная ДНК. \r\n\r\nГарантируется, что это строка является корректной закодированной записью некоторой строки из символов <<\\t{A}>>, <<\\t{G}>>, <<\\t{C}>> и <<\\t{T}>>.","authorName":"Arsenii Kirillov","sampleTests":[{"output":"3 6 A\r\n1 2 C\r\n","input":"5AC5A2C\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Изменённая ДНК","interaction":null,"memoryLimit":536870912,"tutorial":"\\medskip\r\n\\textit{Автор задачи: Олег Христенко}\r\n\\medskip\r\n\r\n\\subsection*{Общая идея}\r\nДля того, чтобы получить минимальную длину, всегда выгодно удалить какой-то элемент, а чтобы получить максимальную длину, нужно добавить какой-то элемент. Докажем это. \r\n\r\nДля минимума. Пусть мы заменили какой-то символ. Вместо этого удалим этот символ. Длина каждого из соседних блоков не изменится, либо они сольются в один. В любом случае длина закодированной строки получится меньше или равна, чем при замене. Аналогично, вместо добавления символа всегда выгоднее удалить символ перед ним.\r\n\r\nДля максимума. Пусть мы заменили какой-то символ. Тогда вместо этого добавим в эту позицию тот символ, на который мы заменили. Длина каждого из соседних блоков не уменьшится, значит длина закодированной версии полученной строки будет не меньше. Аналогично вместо удаления символа всегда выгоднее добавить символ перед ним.\r\n\r\nПерейдем теперь к рассмотрению того, как решить, какую именно операцию сделать.\r\n\r\n\\subsection*{Подзадачи 1 и 2}\r\nДля того, чтобы решить первые две подзадачи, достаточно перебрать место, в которое нужно вставить новый элемент, или удалить существующий. После фиксирования изменения, можно посчитать длину закодированной строки полным проходом по ней. Асимптотика этого решения $O(L^2)$.\r\n\r\n\\subsection*{Подзадача 3}\r\nДля того, чтобы решить третью подзадачу, нужно заметить, что каждый блок одинаковых символов, изменился не сильно. Поэтому после изменения символа достаточно для каждого исходного блока посчитать новую длину этого блока или новых блоков, которые появились после изменения. Асимптотика решения $O(n \\cdot L)$.\r\n\r\n\\subsection*{Подзадача 4}\r\nДля того, чтобы решить четвертую подзадачу, нужно заметить, что после изменения меняется только блок, в котором произошло изменение, или соседние с ним блоки. Для всех остальных блоков длина не меняется, и её можно не пересчитывать. Асимптотика решения $O(L)$.\r\n\r\n\\subsection*{Подзадача 5}\r\nДля того, чтобы решить пятую подзадачу, нужно научиться понимать, как правильно удалять и добавлять символы. \r\n\r\nЕсли в строке есть блок длины $1$, соседние блоки которого содержат одинаковые символы, то при удалении этого символа эти блоки объединятся в один, и длина закодированной строки уменьшится. Если в строке есть блок длины $1$, то при его удалении длина строки уменьшится на $1$. Если в строке есть блок длины $2$, то при удалении символа из него, в его кодировке больше не нужно будет писать число, и длина строки уменьшится на $1$. Если в строке есть блок длины ${10}^x$, то при удалении символа из него длина числа уменьшится на $1$. Это все возможные способы уменьшения длины при удалении символа. \r\n\r\nПри добавлении символа можно поставить его в начало для создания нового блока длины $1$, чтобы длина строки увеличилась на $1$. Также можно какой-то блок разделить на два, если добавить другой символ внутри блока. Для блока длины до $20$, достаточно перебрать, где именно будет новый символ. Если длина блока от $2 \\cdot {10}^x$ до ${10}^{x + 1}$, то из него можно выделить блок размера ${10}^x$, и увеличить длину строки на $x + 3$. Если длина блока от ${10}^x + {10}^{x - 1}$ до $2 \\cdot {10}^x$, то из него можно выделить блок длины ${10}^x$, и увеличить длину строки на $x + 2$. Если длина блока от ${10}^x$ до ${10}^x + {10}^{x - 1}$, то из него можно выделить блок длины $8 \\cdot {10}^{x - 1}$, и увеличить длину строки на $x + 1$. Это все возможные способы увеличить длину строки при добавлении символа.\r\n\r\nДля каждого блока проверим все оптимальные способы добавления и удаления символа и выберем оптимальный способ среди всех. Так как для каждого блока оптимальных способов всего $O(1)$, то асимптотика решения $O(n)$.\r\n"}