{"scoring":"Баллы за каждую подзадачу начисляются только в случае, если все тесты для этой\r\nподзадачи и необходимых подзадач успешно пройдены.\r\n\r\n\\begin{center}\r\n\\renewcommand{\\arraystretch}{1.3}\r\n\\begin{tabular}{|c|c|c|c|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Доп. ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Информация\\\\о проверке\\\\\\vspace{2mm}}} \r\n\\\\ \\hline\r\n1 & 17 & $a = 0$, $x = 0$ &  & полная \\\\ \\hline\r\n2 & 14 & $a = 0$, $b = 0$ &  & полная \\\\ \\hline\r\n3 & 20 & $a = b$ & 2 & первая ошибка \\\\ \\hline\r\n4 & 20 & $x = y$ & & первая ошибка \\\\ \\hline\r\n5 & 29 & нет & 1 -- 4 & первая ошибка\\\\ \\hline\r\n\\end{tabular}\r\n\\end{center}\r\n","notes":"В примере выгодно сначала ввести в строй второй станок и за оставшиеся $15$ минут изготовить $45$ деталей, а затем ввести в строй первый и за оставшиеся $5$ минут изготовить на нём еще $20$ деталей. \r\n\r\nЕсли сначала ввести в строй первый станок и изготовить на нем в оставшиеся $10$ минут $40$ деталей, то после введения в строй второго на нем удастся изготовить лишь $15$ деталей, суммарно $55$, что меньше, чем $65$.","legend":"На производстве имеется два станка. Необходимо изотовить как можно больше деталей за сегодняшнюю смену, продложительность которой $k$ минут.\r\n\r\nСтанки находятся в законсервированном состоянии. Для того, чтобы ввести в строй первый станок, требуется $a$ минут, после чего он будет производить $x$ деталей в минуту. Для того, чтобы ввести в строй второй станок, требуется $b$ минут, после чего он будет производить $y$ деталей в минуту.\r\n\r\nДля введения в строй станка требуется присутствие инженера, поэтому нельзя вводить в строй два станка одновременно. При этом введение станка в строй и изготовление деталей на другом станке, а также одновременное изготовление деталей на двух станках разрешается.\r\n\r\nТребуется выяснить, какое максимальное количество деталей удастся изготовить за $k$ минут.","authorLogin":"dan.io","language":"russian","timeLimit":1000,"output":"Выведите единственное число~--- максимальное количество деталей, которое удастся изготовить за смену.\r\n\r\nОбратите внимание, что ответ в этой задаче может быть довольно большим и не помещаться в 32-битные типы данных. Рекомендуется использовать 64-битный тип данных, например <<\\t{\\mbox{long long}}>> в C++ или <<\\t{int64}>> в Паскале.","inputFile":"stdin","outputFile":"stdout","input":"В первой строке ввода дано единственное целое неотрицательное число $k$~--- количество минут в смене ($0 \\le k \\le 10^9$).\r\n\r\nВо второй строке ввода даны целые неотрицательные числа $a$ и $x$~--- время введения первого станка в строй и количество деталей, которое он изготавливает за одну минуту ($0 \\le a, x \\le 10^9$).\r\n\r\nВ третьей строке ввода даны целые неотрицательные числа $b$ и $y$~--- время введения второго станка в строй и количество деталей, которое он изготавливает за одну минуту ($0 \\le b, y \\le 10^9$).\r\n","authorName":"Daniel Oreshnikov","sampleTests":[{"output":"65\r\n","input":"20\r\n10 4\r\n5 3\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Два станка","interaction":null,"memoryLimit":536870912,"tutorial":"\\medskip\r\n\\textit{Автор задачи: Даниил Орешников}\r\n\\medskip\r\n\r\nВ первых четырех подзадачах достаточно легко найти конкретную формулу, которая позволяет найти ответ. Обозначим искомое количество деталей как $r$.\r\n\r\n\\subsection*{Подзадача 1}\r\nЕсли $a = 0$ и $x = 0$, то первый станок вообще нет смысла использовать. Введем в строй второй и получим ответ: $$r = b \\cdot \\max(k - b, 0).$$\r\n\r\nВажно не забыть, что время на запуск может оказаться больше $k$, и тогда количество деталей будет равно $0$, для чего мы и берем $\\max$ в формуле.\r\n\r\n\\subsection*{Подзадача 2}\r\nЕсли $a$ и $b$ равны нулю, то можно сразу запустить оба станка в работу и получить ответ: \r\n$$r = (x + y) \\cdot k.$$\r\n\r\n\\subsection*{Подзадача 3}\r\nКогда $a = b$, выгодно сначала ввести в строй наиболее производительный станок, и сразу после этого начать вводить в строй второй. Ответ тогда будет равен: \r\n$$r = \\max(x, y) \\cdot \\max(k - a, 0) + \\min(x, y) \\cdot \\max(k - 2a, 0).$$ \r\n\r\nТут снова надо не забыть о случаях, когда время на введение в строй больше доступного нам.\r\n\r\n\\subsection*{Подзадача 4}\r\n\r\nЕсли станки производят детали с одинаковой скоростью, то требуется ввести в строй сначала тот, на запуск которого уйдет меньше времени, чтобы детали раньше начали производиться. Получаем: \r\n$$r = a \\cdot \\max(k - \\min(a, b), 0) + a \\cdot \\max(k - a - b, 0).$$\r\n\r\n\\subsection*{Подзадача 5}\r\n\r\nТеперь посмотрим как решать общий случай. Переберем два варианта: какой станок будем вводить в строй первым. Если мы сначала введем в строй первый станок, ответ будет: \r\n$$r_1 = x \\cdot \\max(k - a, 0) + y \\cdot \\max(k - a - b, 0).$$ \r\n\r\nНаоборот, если сначала ввести в строй второй, то получим: \r\n$$r_2 = y \\cdot \\max(k - b, 0) + x \\cdot \\max(k - a - b, 0).$$ \r\n\r\nЧтобы получить ответ на задачу, достаточно взять максимум из двух этих значений:\r\n$$r = \\max(r_1, r_2).$$\r\n\r\nЗаметим, что, разумеется, решение пятой подзадачи решает также и первые четыре подзадачи."}