{"scoring":"Баллы за каждую подзадачу начисляются только в случае, если все тесты для этой\r\nподзадачи и необходимых подзадач успешно пройдены.\r\n\r\n\\begin{center}\r\n\\renewcommand{\\arraystretch}{1.3}\r\n\\begin{tabular}{|c|c|c|c|c|}\r\n\\hline\r\n\\textbf{Подзадача} & \r\n\\textbf{Баллы} & \r\n\\textbf{Доп. ограничения} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Необходимые\\\\подзадачи\\\\\\vspace{2mm}}} & \r\n\\parbox{3cm}{\\textbf{\\centering\\\\Информация\\\\о проверке\\\\\\vspace{2mm}}} \\\\\r\n\\hline\r\n1 & 8 & $n \\le 8$, $m_i = 1$, $s_i \\le 100$ & & первая ошибка \\\\\r\n\\hline\r\n2 & 8 & $n \\le 8$, $s_i \\le 100$ & 1 & первая ошибка \\\\\r\n\\hline\r\n3 & 21 & $n \\le 1\\,000$ & 1, 2 & первая ошибка \\\\\r\n\\hline\r\n4 & 21 & $\\sum m_i > n$ & & первая ошибка \\\\\r\n\\hline\r\n5 & 21 & $s_i \\le 100$ & 1, 2 & первая ошибка \\\\\r\n\\hline\r\n6 & 21 & нет & 1--5 & первая ошибка \\\\\r\n\\hline\r\n\\end{tabular}\r\n\\end{center}","notes":"","legend":"Для связи с Землёй членам экспедиции на Марс необходимо собрать антенну. Антенна в разобранном состоянии представляет собой $n$ фрагментов, $i$-й фрагмент представляет собой штангу длиной $s_i$ сантиметров, на которой закреплены $m_i$ перекладин. Каждый фрагмент содержит хотя бы одну перекладину.\r\n\r\nУ каждой штанги есть начало, в котором расположен штекер, и конец, в котором расположено гнездо. Любые две штанги можно последовательно соединить, присоединив начало одной к концу другой. Для каждой перекладины известно расстояние от начала её штанги в сантиметрах. Для $i$-го фрагмента это расстояние может быть от $0$ до $s_i$, значение 0 означает, что перекладина находится непосредственно в начале штанги, значение $s_i$ \"--- что она находится непосредственно в конце штанги. Толщиной перекладин и размерами штекера и гнезда следует пренебречь.\r\n\r\nНа рисунке показаны три фрагмента антенны из первого примера и отмечены расстояния от начала штанги до перекладины.\r\n\r\n\\begin{center}\r\n\\includegraphics[width=14cm]{parts.png}\r\n\\end{center}\r\n\r\nЧтобы корректно собрать антенну, необходимо соединить в некотором порядке все $n$ фрагментов, при этом расстояние между любыми двумя соседними перекладинами должно быть одинаковым. \r\n\r\nНа рисунке показан корректный способ соединить фрагменты в первом примере.\r\n\r\n\\begin{center}\r\n\\includegraphics[width=11.53cm]{connected.png}\r\n\\end{center}\r\n\r\nК сожалению, члены экспедиции забыли инструкцию по сборке антенны на Земле, а передать её на Марс не представляется возможным \"--- ведь антенна ещё не собрана. Помогите исследователям!\r\n\r\nТребуется определить, в каком порядке необходимо соединить фрагменты антенны, чтобы установить связь с Землей.\r\n\r\n\r\n","authorLogin":"BudAlNik","language":"russian","timeLimit":1000,"output":"Если собрать антенну указанным образом возможно, в первой строке выведите <<\\t{Yes}>>, а во второй строке выведите перестановку чисел от $1$ до $n$~--- номера фрагментов в порядке, в котором их следует соединить, начало каждого следующего фрагмента в этом порядке присоединяется к концу предыдущего фрагмента. Если существует несколько подходящих ответов, можно вывести любой из них.\r\n\r\nЕсли собрать антенну невозможно, в единственной строке выведите <<\\t{No}>>.","inputFile":"stdin","outputFile":"stdout","input":"В первой строке дано одно число $n$~--- количество фрагментов ($1 \\le n \\le 100\\,000$).\r\n\r\nДалее дано описание $n$ фрагментов. В первой строке описания фрагмента даны два целых числа $m_i$ и $s_i$~--- количество перекладин и длина штанги в $i$-м фрагменте ($1 \\le m_i \\le 100\\,000$, $0 \\le s_i \\le 10^9$). В следующей строке даны $m_i$ целых чисел $p_{i, j}$~--- позиции перекладин, $p_{i, j}$ равно расстоянию в сантиметрах от начала штанги до $j$-й перекладины на ней ($0 \\le p_{i, 1} < p_{i, 2} < \\dots < p_{i, m_i} \\le s_i$).\r\n\r\nСумма всех $m_i$ не превышает $100\\,000$.","authorName":"Nikolay Budin","sampleTests":[{"output":"Yes\r\n2 1 3 \r\n","input":"3\r\n1 7\r\n3\r\n1 8\r\n6\r\n2 8\r\n1 6\r\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"Yes\r\n1\r\n","input":"1\r\n1 7\r\n5\r\n","inputFile":"example.02","outputFile":"example.02.a"},{"output":"No\r\n","input":"1\r\n3 10\r\n2 5 9\r\n","inputFile":"example.03","outputFile":"example.03.a"},{"output":"No\r\n","input":"3\r\n1 5\r\n3\r\n1 3\r\n3\r\n1 6\r\n3\r\n","inputFile":"example.04","outputFile":"example.04.a"},{"output":"Yes\r\n3 2 4 1 \r\n","input":"4\r\n1 5\r\n0\r\n1 0\r\n0\r\n1 3\r\n3\r\n1 0\r\n0\r\n","inputFile":"example.05","outputFile":"example.05.a"}],"name":"Антенна","interaction":null,"memoryLimit":536870912,"tutorial":"\\medskip\r\n\\textit{Авторы задачи: Даниил Орешников, Геннадий Короткевич}\r\n\\medskip\r\n\r\n\\subsection*{Подзадача 1}\r\nДля того, чтобы решить первую подзадачу, можно перебрать, в каком порядке нужно соединить фрагменты. Всего существует $n!$ таких вариантов. Для каждого варианта можно вычислить позиции всех перекладин и проверить, подходит ли такой вариант.\r\n\r\n\\subsection*{Подзадача 2}\r\nДля того, чтобы решить вторую подзадачу, нужно заметить, что если на одном из фрагментов присутствует более одной перекладины, то, если существует способ правильно собрать антенну, расстояние между соседними перекладинами должно быть равно расстоянию между перекладинами на этом фрагменте. Поэтому можно заранее проверить, что расстояния между соседними перекладинами в каждом отдельно взятом фрагменте равны. После чего можно оставить в каждом фрагменте только первую и последнюю перекладины. Затем, как в предыдущей подзадаче, перебрать порядок фрагментов и проверить, подходит ли он.\r\n\r\n\\subsection*{Общая идея}\r\nКак во второй подзадаче, оставим на каждом фрагменте только первую и последнюю перекладины. Пусть на $i$-м фрагменте первая перекладина находится на расстоянии $l_i$ от начала, а последняя~--- на расстоянии $r_i$ от конца. Научимся проверять, существует ли порядок фрагментов, при котором расстояние между соседними перекладинами будет равно $d$. Пусть такой порядок существует, обозначим его $q_1$, $q_2$, \\dots $q_n$. Тогда должно выполняться $r_{q_i} + l_{q_{i + 1}} = d$ ($1 \\le i \\le n - 1$), значит $l_{q_{i + 1}} = d - r_{q_i}$. Рассмотрим граф, вершинами которого являются все целые числа. Проведем ориентированное ребро из $l_{i}$ в $d - r_{i}$ для всех $i$. Заметим, что искомый порядок существует тогда и только тогда, когда в построенном графе существует Эйлеров путь. Поиск Эйлерова пути (и проверка существования) является стандартным алгоритмом.\r\n\r\nНапример, в первом тесте из примеров, $l_1 = 3$, $r_1 = 4$, $l_2 = 6$, $r_2 = 2$, $l_3 = 1$, $r_3 = 2$. В ответе на тест, $d = 5$. Построим граф по этим данным:\r\n\r\n\\begin{center}\r\n\\includegraphics[width=0.5\\textwidth]{pic.0}\r\n\\end{center}\r\n\r\nРядом с вершинами написаны соответствующие им числа, а рядом с ребрами~--- номера соответствующих им фрагментов. Видно, что последовательность ребер $2$, $1$, $3$ является Эйлеровым путем.\r\n\r\nДля решения оставшихся подзадач, мы будем находить некоторое множество значений $d$, каждое из которых будем проверять за линейное время алгоритмом из предыдущего абзаца.\r\n\r\n\\subsection*{Подзадача 4}\r\nЧтобы решить четвертую подзадачу, нужно заметить, что по принципу Дирихле всегда будет существовать хотя бы один фрагмент, содержащий хотя бы две перекладины. Поэтому, если искомый порядок существует, расстояние $d$ между соседними перекладинами должно быть равно расстоянию между соседними перекладинами на этом фрагменте. Воспользуемся алгоритмом и проверим, подходит ли данное $d$.\r\n\r\n\\subsection*{Подзадача 3}\r\nЧтобы решить третью подзадачу, можно перебрать два варианта:\r\n\\begin{itemize}\r\n\\item Если фрагмент номер $1$ не будет стоять самым последним, то можно перебрать номер фрагмента $i$, который будет стоять сразу после фрагмента $1$, и проверить $d = r_1 + l_i$.\r\n\\item Если фрагмент номер $1$ будет стоять самым последним, то фрагмент номер $2$ не будет стоять последним. Можно перебрать номер фрагмента $i$, который будет стоять после фрагмента $2$, и проверить $d = r_2 + l_i$.\r\n\\end{itemize}\r\n\r\nТаким образом, мы проверим $O(n)$ вариантов, каждый за время $O(n)$. Итого, решение работает за $O(n^2)$.\r\n\r\n\\subsection*{Подзадача 5}\r\nЧтобы решить пятую подзадачу, можно проверить все значения $d$ от $0$ до $200$. Дополнительно ускорить решение можно проверяя только значения $d$ от $0$ до $\\lfloor\\frac{100 \\cdot n}{n - 1}\\rfloor$.\r\n\r\n\\subsection*{Подзадача 6}\r\nНаконец, чтобы решить задачу на полный балл, нужно было научиться проверять только $O(1)$ различных вариантов $d$. Рассмотрим пары $(l_{q_i}, r_{q_{i + 1}})$ и отсортируем их в порядке возрастания $l$. Заметим, что так как суммы значений в каждой паре равны, значения $r$ будут убывать. Среди всех значений $l$ в рассмотренных парах не присутствует ровно одно, соответствующее первому фрагменту. Аналогично, среди всех значений $r$ отсутствует значение, соответствующее последнему фрагменту. Таким образом, можно отсортировать все значения $l$ в порядке возрастания, все значения $r$ в порядке убывания и проверить $4$ варианта значения $d$: сумма одного из двух минимальных значений $l$ и одного из двух максимальных значений $r$."}